//***********************************************************************
//*                                                                     *
//*   Copyright (c) 1985-2023, American Megatrends International LLC.   *
//*                                                                     *
//*      All rights reserved. Subject to AMI licensing agreement.       *
//*                                                                     *
//***********************************************************************

/** @file AmiTseTcgStorageSecurity.uni
    Strings related to OPAL password

**/

/=#
#include "VFR.uni"

#string STR_TCG_STORAGE_EMPTY                   #language eng ""
#string STR_TCG_STORAGE_SECURITY_UNSUPPORTED    #language eng "Setting password is not supported for this drive"
                                                #language fra "Setting password is not supported for this drive"
#string STR_TCG_STORAGE_ERROR_PSWD              #language eng "Invalid Password. TCG Storage device is Locked"
                                                #language fra "Invalid Password. TCG Storage device is Locked"
#string STR_TCG_STORAGE_SECURITY_PROMPT         #language eng "TCG Storage Security Drive"
#string STR_TCG_STORAGE_ENTER_USER              #language eng "Enter User password:"
#string STR_TCG_STORAGE_ENTER_ADMIN             #language eng "Enter Admin password:"
#string STR_TCGSEC_ERROR_WARNING_TITLE          #language eng "ERROR!!!"
#string STR_TRIES_COUNT_REACHED_LIMIT_MESSAGE   #language eng "Password Tries count has reached the TryLimit value of the device. Please try again after a power cycle."
#if ( defined(TCG_KMS_PASSWORD) && (TCG_KMS_PASSWORD == 1) )
#string STR_TCG_STORAGE_ENTER_KEYID          #language eng "Enter KMS Password Key ID:"
#endif

